Repository: abughuffa/TrdBx
Catalog: src/Server.UI/Resources/Pages/TrdBx/Invoices/Invoices.*.resx
Languages: ar_ly

source: as Paid
ar_ly: كمسددة

source: To Customer
ar_ly: لصالح الزبون

source: Cancel Invoice
ar_ly: إلغاء الفاتورة

source: Create Invoice
ar_ly: انشاء فاتورة

source: Customer
ar_ly: الزبون

source: Due Date
ar_ly: ت. الاستحقاق

source: Filter by Customer
ar_ly: تصفية بحسب الزبون

source: Grand Total
ar_ly: الاجمالي الكلي

source: Ignore Taxes even if it was required!
ar_ly: تجاهل الضريبة حتى و لو كانت مستحقة!

source: Invoice Date
ar_ly: ت. الفاتورة

source: Description
ar_ly: بيــــان

source: InvoiceNo
ar_ly: ر. الفاتورة

source: Invoice Date is required!
ar_ly: تاريخ الفاتورة مطلوب!

source: Invoices
ar_ly: الفواتير

source: Invoice Type
ar_ly: نوع الفاتورة

# IStatus
source: Status
ar_ly: الحالة

source: Pay
ar_ly: سداد

source: Set Invoice
ar_ly: تعيين الفاتورة

source: Set Invoice {0} as Paid
ar_ly: تعيين الفاتورة {0} كمسددة

source: Set Next Status
ar_ly: تعيين الحالة اللاحقة

source: Set Previous Status
ar_ly: تعيين الحالة السابقة

source: Taxes
ar_ly: الضريبة

source: Total
ar_ly: الاجمالي

source: Update Invoice
ar_ly: تحديث الفاتورة

source: Enter the amount of payment and Select Payment date. to be added to {0}
ar_ly: ادخل القيمة و تاريخ السداد لإضافته للفاتورة {0}.

source: Invoice #
ar_ly: الفاتورة #

source: Invoice Details
ar_ly: تفاصيل الفاتورة

source: Loading invoice details...
ar_ly: تحميل تفاصيل الفاتورة...

source: Invoice not found. Please check the invoice ID.
ar_ly: الفاتورة غير موجدة الرجاء التحقق من المعرف

source: Invoice Items
ar_ly: عناصر الفاتورة

source: Items Group #
ar_ly: مجموعة العناصر #

source: Subtotal :
ar_ly: القيمة :

source: Items
ar_ly: العناصر

source: Amount
ar_ly: القيمة

source: Total:
ar_ly: الإجمالي

source: Discount:
ar_ly: التخفيض:

source: Taxable:
ar_ly: المستحق:

source: Tax:
ar_ly: الضريبة:

source: Grand Total:
ar_ly: الإجمالي الكلي:

source: Invoice deleted successfully
ar_ly: تم حذف الفاتورة بنجاح

source: Item deleted successfully
ar_ly: تم حذف العنصر بنجاح

source: Item group deleted successfully
ar_ly: تم حذف مجموعة العناصر بنجاح

source: Filter By Type
ar_ly: تصفية بحسب النوع

source: Filter By Status
ar_ly: تصفية بحسب الحالة

source: Payment Date Is Required!
ar_ly: تاريخ السداد مطلوب!

source: Amount is required!
ar_ly: القيمة مطلوبة!

source: Tax Rate
ar_ly: نسبة الضريبة

source: Tax Rate is required!
ar_ly: نسبة الضريبة مطلوبة!

source: Discount Rate
ar_ly: نسبة التخفيض

source: Discount Rate is required!
ar_ly: نسبة التخفيض مطلوبة!

source: Grand Total
ar_ly: الاجمالي الكلي
