namespace CleanArchitecture.Blazor.Application.Features.Common;
internal static class SubscriptionDescs
{
    internal static string Desc01 = "الدورة الأولى – اشتراك كامل بمدة (365) يوماً من تاريخ التركيب للفترة من {0} حتى {1}.";
    internal static string Desc02 = "الدورة الأولى – اشتراك للاستضافة بمدة (365) يوماً من تاريخ التركيب للفترة من {0} حتى {1}.";
    internal static string Desc03 = "الدورة الأولى – اشتراك للتمديد بمدة (365) يوماً من تاريخ التركيب للفترة من {0} حتى {1}.";

    internal static string Desc04 = "تغيير طبيعة الاشتراك من اشتراك استضافة إلى اشتراك كامل للفترة من {0} حتى {1}.";
    internal static string Desc05 = "تغيير طبيعة الاشتراك من اشتراك للاستضافة إلى اشتراك للتمديد للفترة من {0} حتى {1}.";
    internal static string Desc06 = "تغيير طبيعة الاشتراك من اشتراك للتمديد إلى اشتراك كامل للفترة من {0} حتى {1}.";
    internal static string Desc07 = "تغيير طبيعة الاشتراك من اشتراك للتمديد إلى اشتراك للاستضافة للفترة من {0} حتى {1}.";

    internal static string Desc08 = "دورة اشتراك كامل من تاريخ العملية حتى آخر يوم بالسنة الحالية للفترة من {0} حتى {1}.";
    internal static string Desc10 = "دورة اشتراك للاستضافة من تاريخ العملية حتى آخر يوم بالسنة الحالية للفترة من {0} حتى {1}.";
    internal static string Desc12 = "دورة اشتراك للتمديد من تاريخ العملية حتى آخر يوم بالسنة الحالية للفترة من {0} حتى {1}.";
    internal static string Desc09 = "دورة اشتراك كامل من تاريخ العملية حتى نهاية الدورة السابقة الغير مسددة للفترة من {0} حتى {1}.";
    internal static string Desc11 = "دورة اشتراك للاستضافة من تاريخ العملية حتى تاريخ نهاية الدورة السابقة الغير مسددة للفترة من {0} حتى {1}.";

    internal static string Desc19 = "قيمة اشتراك تمديد مستحقة عن دورة سابقة للفترة من {0} حتى {1}.";
    internal static string Desc21 = "قيمة اشتراك تمديد مستحقة عن دورة سابقة غير مسددة للفترة من {0} حتى {1}.";
    internal static string Desc23 = "قيمة اشتراك تمديد مستحقة عن دورة سابقة حتى تاريخ إلغاء التفعيل للفترة من {0} حتى {1}.";
    internal static string Desc18 = "قيمة اشتراك تمديد مستحقة عن دورة سابقة حتى تاريخ العملية للفترة من {0} حتى {1}.";
    internal static string Desc20 = "قيمة اشتراك تمديد مستحقة عن دورة سابقة غير مسددة حتى تاريخ العملية للفترة من {0} حتى {1}.";

    internal static string Desc24 = "قيمة اشتراك كامل مستحقة عن دورة سابقة للفترة من {0} حتى {1}.";
    internal static string Desc25 = "قيمة اشتراك كامل مستحقة عن دورة سابقة غير مسددة للفترة من {0} حتى {1}.";
    internal static string Desc26 = "قيمة اشتراك كامل مستحقة عن دورة سابقة حتى تاريخ إلغاء التفعيل للفترة من {0} حتى {1}.";

    internal static string Desc14 = "قيمة اشتراك استضافة مستحقة عن دورة سابقة حتى تاريخ إلغاء التفعيل للفترة من {0} حتى {1}.";
    internal static string Desc15 = "قيمة اشتراك استضافة مستحقة عن دورة سابقة للفترة من {0} حتى {1}.";
    internal static string Desc17 = "قيمة اشتراك استضافة مستحقة عن دورة سابقة غير مسددة للفترة من {0} حتى {1}.";
    internal static string Desc13 = "قيمة اشتراك استضافة مستحقة عن دورة سابقة حتى تاريخ العملية للفترة من {0} حتى {1}.";
    internal static string Desc16 = "قيمة اشتراك استضافة مستحقة عن دورة سابقة غير مسددة حتى تاريخ العملية للفترة من {0} حتى {1}."; 


internal static string	Desc10001	=	"معالجة فئة – دورة اشتراك ف1 بناءً على بقية دورة اشتراك ف2 السابقة للفترة من {0} حتى {1}."	;
internal static string	Desc10002	=	"معالجة فئة – دورة اشتراك ف1 بناءً على بقية دورة اشتراك ف3 السابقة للفترة من {0} حتى {1}."	;
internal static string	Desc10003	=	"معالجة فئة – دورة اشتراك ف2 بناءً على بقية دورة اشتراك ف2 السابقة للفترة من {0} حتى {1}."	;
internal static string	Desc10004	=	"معالجة فئة – دورة اشتراك ف2 بناءً على بقية دورة اشتراك ف3 السابقة للفترة من {0} حتى {1}."	;
internal static string	Desc10005	=	"معالجة فئة – دورة اشتراك ف3 بناءً على بقية دورة اشتراك ف1 السابقة للفترة من {0} حتى {1}."	;
internal static string	Desc10006	=	"معالجة فئة – دورة اشتراك ف3 بناءً على بقية دورة اشتراك ف2 السابقة للفترة من {0} حتى {1}."	;
internal static string	Desc10007	=	"الدورة الأولى – اشتراك ف1 بمدة (365) يوماً من تاريخ التركيب للفترة من {0} حتى {1}."	;
internal static string	Desc10008	=	"الدورة الأولى – اشتراك ف2 بمدة (365) يوماً من تاريخ التركيب للفترة من {0} حتى {1}."	;
internal static string	Desc10009	=	"الدورة الأولى – اشتراك ف3 بمدة (365) يوماً من تاريخ التركيب للفترة من {0} حتى {1}."	;
internal static string	Desc10010	=	"تحديث – إنهاء اشتراك ف1 بتاريخ العملية لتصبح  ضمن الفترة من {0} حتى {1}."	;
internal static string	Desc10011	=	"تحديث – إنهاء اشتراك ف2 بتاريخ العملية لتصبح  ضمن الفترة من {0} حتى {1}."	;
internal static string	Desc10012	=	"تحديث – إنهاء اشتراك ف3 بتاريخ العملية لتصبح  ضمن الفترة من {0} حتى {1}."	;
internal static string	Desc10013	=	"تحديث قيمة مستحقة – لاشتراك ف1 عن دورة سابقة غير مسددة للفترة من {0} حتى {1}."	;
internal static string	Desc10014	=	"تحديث قيمة مستحقة – لاشتراك ف2 عن دورة سابقة غير مسددة للفترة من {0} حتى {1}."	;
internal static string	Desc10015	=	"تحديث قيمة مستحقة – لاشتراك ف3 عن دورة سابقة غير مسددة للفترة من {0} حتى {1}."	;
internal static string	Desc10016	=	"دورة اشتراك ف1 من تاريخ العملية حتى آخر يوم بالسنة الحالية للفترة من {0} حتى {1}."	;
internal static string	Desc10017	=	"دورة اشتراك ف1 من تاريخ العملية حتى نهاية الدورة السابقة الغير مسددة للفترة من {0} حتى {1}."	;
internal static string	Desc10018	=	"دورة اشتراك ف2 من تاريخ العملية حتى آخر يوم بالسنة الحالية للفترة من {0} حتى {1}."	;
internal static string	Desc10019	=	"دورة اشتراك ف2 من تاريخ العملية حتى نهاية الدورة السابقة الغير مسددة للفترة من {0} حتى {1}."	;
internal static string	Desc10020	=	"دورة اشتراك ف3 من تاريخ العملية حتى آخر يوم بالسنة الحالية للفترة من {0} حتى {1}."	;
internal static string	Desc10021	=	"دورة اشتراك ف3 من تاريخ العملية حتى نهاية الدورة السابقة الغير مسددة للفترة من {0} حتى {1}."	;
internal static string	Desc10022	=	"قيمة مستحقة – لاشتراك ف1 عن دورة سابقة للفترة من {0} حتى {1}."	;
internal static string	Desc10023	=	"قيمة مستحقة – لاشتراك ف2 عن دورة سابقة للفترة من {0} حتى {1}."	;
internal static string	Desc10024	=	"قيمة مستحقة – لاشتراك ف3 عن دورة سابقة للفترة من {0} حتى {1}."	;

internal static string	Desc10025	=	"معالجة فئة – دورة اشتراك ف1 بناءً على بقية دورة اشتراك ف2 المنقول من الوحدة المستبدلة للفترة من {0} حتى {1}."	;
internal static string	Desc10026	=	"معالجة فئة – دورة اشتراك ف1 بناءً على بقية دورة اشتراك ف3 المنقول من الوحدة المستبدلة للفترة من {0} حتى {1}."	;
internal static string	Desc10027	=	"دورة اشتراك ف1 منقول من الوحدة المستبدلة للفترة من {0} حتى {1}."	;
internal static string	Desc10028	=	"معالجة فئة – دورة اشتراك ف2 بناءً على بقية دورة اشتراك ف1 المنقول من الوحدة المستبدلة للفترة من {0} حتى {1}."	;
internal static string	Desc10029	=	"معالجة فئة – دورة اشتراك ف2 بناءً على بقية دورة اشتراك ف3 المنقول من الوحدة المستبدلة للفترة من {0} حتى {1}."	;
internal static string	Desc10030	=	"دورة اشتراك ف2 منقول من الوحدة المستبدلة للفترة من {0} حتى {1}."	;
internal static string	Desc10031	=	"معالجة فئة – دورة اشتراك ف3 بناءً على بقية دورة اشتراك ف1 المنقول من الوحدة المستبدلة للفترة من {0} حتى {1}."	;
internal static string	Desc10032	=	"معالجة فئة – دورة اشتراك ف3 بناءً على بقية دورة اشتراك ف2 المنقول من الوحدة المستبدلة للفترة من {0} حتى {1}."	;
internal static string	Desc10033	=	"دورة اشتراك ف3 منقول من الوحدة المستبدلة للفترة من {0} حتى {1}."	;
internal static string	Desc10034	=	"تحديث – إنهاء اشتراك ف1 الغير مسدد بتاريخ العملية لتصبح  ضمن الفترة من {0} حتى {1}."	;
internal static string	Desc10035	=	"تحديث – إنهاء اشتراك ف2 الغير مسدد بتاريخ العملية لتصبح  ضمن الفترة من {0} حتى {1}."	;
internal static string	Desc10036	=	"تحديث – إنهاء اشتراك ف3 الغير مسدد بتاريخ العملية لتصبح  ضمن الفترة من {0} حتى {1}."	;
internal static string	Desc10037	=	"تحديث نقل – اشتراك ف1 إلى الوحدة البديلة للفترة من {0} حتى {1}."	;
internal static string	Desc10038	=	"تحديث نقل – اشتراك ف2 إلى الوحدة البديلة للفترة من {0} حتى {1}."	;
internal static string	Desc10039	=	"تحديث نقل – اشتراك ف3 إلى الوحدة البديلة للفترة من {0} حتى {1}."	;



}