namespace CleanArchitecture.Blazor.Application.Features.Common;
internal static class SubscriptionDescs
{
    internal static string Desc01 = "الدورة الأولى – اشتراك كامل بمدة (365) يوماً من تاريخ التركيب للفترة من {0} حتى {1}.";
    internal static string Desc02 = "الدورة الأولى – اشتراك للاستضافة بمدة (365) يوماً من تاريخ التركيب للفترة من {0} حتى {1}.";
    internal static string Desc03 = "الدورة الأولى – اشتراك للتمديد بمدة (365) يوماً من تاريخ التركيب للفترة من {0} حتى {1}.";

    internal static string Desc04 = "تغيير طبيعة الاشتراك من اشتراك استضافة إلى اشتراك كامل للفترة من {0} حتى {1}.";
    internal static string Desc05 = "تغيير طبيعة الاشتراك من اشتراك للاستضافة إلى اشتراك للتمديد للفترة من {0} حتى {1}.";
    internal static string Desc06 = "تغيير طبيعة الاشتراك من اشتراك للتمديد إلى اشتراك كامل للفترة من {0} حتى {1}.";
    internal static string Desc07 = "تغيير طبيعة الاشتراك من اشتراك للتمديد إلى اشتراك للاستضافة للفترة من {0} حتى {1}.";

    internal static string Desc08 = "دورة اشتراك كامل من تاريخ العملية حتى آخر يوم بالسنة الحالية للفترة من {0} حتى {1}.";
    internal static string Desc10 = "دورة اشتراك للاستضافة من تاريخ العملية حتى آخر يوم بالسنة الحالية للفترة من {0} حتى {1}.";
    internal static string Desc12 = "دورة اشتراك للتمديد من تاريخ العملية حتى آخر يوم بالسنة الحالية للفترة من {0} حتى {1}.";
    internal static string Desc09 = "دورة اشتراك كامل من تاريخ العملية حتى نهاية الدورة السابقة الغير مسددة للفترة من {0} حتى {1}.";
    internal static string Desc11 = "دورة اشتراك للاستضافة من تاريخ العملية حتى تاريخ نهاية الدورة السابقة الغير مسددة للفترة من {0} حتى {1}.";

    internal static string Desc19 = "قيمة اشتراك تمديد مستحقة عن دورة سابقة للفترة من {0} حتى {1}.";
    internal static string Desc21 = "قيمة اشتراك تمديد مستحقة عن دورة سابقة غير مسددة للفترة من {0} حتى {1}.";
    internal static string Desc23 = "قيمة اشتراك تمديد مستحقة عن دورة سابقة حتى تاريخ إلغاء التفعيل للفترة من {0} حتى {1}.";
    internal static string Desc18 = "قيمة اشتراك تمديد مستحقة عن دورة سابقة حتى تاريخ العملية للفترة من {0} حتى {1}.";
    internal static string Desc20 = "قيمة اشتراك تمديد مستحقة عن دورة سابقة غير مسددة حتى تاريخ العملية للفترة من {0} حتى {1}.";

    internal static string Desc24 = "قيمة اشتراك كامل مستحقة عن دورة سابقة للفترة من {0} حتى {1}.";
    internal static string Desc25 = "قيمة اشتراك كامل مستحقة عن دورة سابقة غير مسددة للفترة من {0} حتى {1}.";
    internal static string Desc26 = "قيمة اشتراك كامل مستحقة عن دورة سابقة حتى تاريخ إلغاء التفعيل للفترة من {0} حتى {1}.";

    internal static string Desc14 = "قيمة اشتراك استضافة مستحقة عن دورة سابقة حتى تاريخ إلغاء التفعيل للفترة من {0} حتى {1}.";
    internal static string Desc15 = "قيمة اشتراك استضافة مستحقة عن دورة سابقة للفترة من {0} حتى {1}.";
    internal static string Desc17 = "قيمة اشتراك استضافة مستحقة عن دورة سابقة غير مسددة للفترة من {0} حتى {1}.";
    internal static string Desc13 = "قيمة اشتراك استضافة مستحقة عن دورة سابقة حتى تاريخ العملية للفترة من {0} حتى {1}.";
    internal static string Desc16 = "قيمة اشتراك استضافة مستحقة عن دورة سابقة غير مسددة حتى تاريخ العملية للفترة من {0} حتى {1}.";
}