Repository: abughuffa/TrdBx
Catalog: src/Server.UI/Resources/Pages/TrdBx/Customers/Customers.*.resx
Languages: ar_ly

source: Account
ar_ly: الحساب

source: Account is required!
ar_ly: الحساب مطلوب

source: Address
ar_ly: العنوان

source: BillingPlan
ar_ly: خطة العمل

source: Create Child
ar_ly: انشاء كإبن

source: Create CusPrice
ar_ly: انشاء سعر مخصص

source: Create Parent
ar_ly: انشاء كأب

source: Customer details
ar_ly: تفاصيل الزبون

source: Customer is required!
ar_ly: الزبون مطلوب!

source: Customers
ar_ly: الزبائن

source: Email
ar_ly: البريد الإلكتروني

source: Id
ar_ly: معرف

source: IsAvaliable
ar_ly: الإتاحية

source: IsRenewable
ar_ly: تجديد تلقائي؟

source: IsTaxable
ar_ly: خاضع للضريبة؟

source: Mobile1
ar_ly: ر. المحمول 1

source: Mobile2
ar_ly: ر . المحمول 2

source: Name
ar_ly: الاسم

source: Name is required!
ar_ly: الاسم مطللوب!

source: OldId
ar_ly: معرف قديم

source: Parent
ar_ly: الأب

source: Parent is required!
ar_ly: الأب مطلوب!

source: ParentChild
ar_ly: الأب / الأبن

source: ParentId
ar_ly: معرف الأب

source: Select a Customer
ar_ly: اختر زبون

source: Select Parent
ar_ly: اختر الأب

source: Update Child
ar_ly: تحديث الأبن

source: Update Parent
ar_ly: تحديث الأب

source: UserName
ar_ly: اسم المستخدم

source: UserName is required!
ar_ly: اسم المستخدم مطلوب!

source: View CusPrices
ar_ly: عرض الأسعار المخصصة

source: WUnitGroupId
ar_ly: معرف المجموعة على ويلون

source: WUserId
ar_ly: المعرف على ويلون
