Repository: abughuffa/TrdBx
Catalog: src/Server.UI/Resources/Pages/TrdBx/MyData/Local/Charts.*.resx
Languages: ar_ly

source: # Zoom: {0}x
ar_ly: # تكبير: {0} اكس

source: , using Logarithmic Scale
ar_ly: ، استخدام التدرج اللوغارتمي

source: : Zeros excluded
ar_ly: : استبعاد الأصفار

source: Actions
ar_ly: الأجراءات

source: ago
ar_ly: مضت

source: Count
ar_ly: العدد

source: Data Analysis
ar_ly: تحليل البيانات

source: Data Points
ar_ly: نقاط البيانات

source: Date
ar_ly: التاريخ

source: Day of Week
ar_ly: يوم الاسبوع

source: End Date
ar_ly: تاريخ الانتهاء

source: Error loading data: {0}
ar_ly: خطأ تحميل البيانات: {0}

source: Error scrolling to impulse: {0}
ar_ly: خطأ اثناء التمرير للنبضة: {0}

source: Exclude Zeros
ar_ly: الأصفار مستبعدة

source: Export
ar_ly: تصدير

source: Export failed: {0}
ar_ly: فشل التصدير: {0}

source: Export ready!
ar_ly: التصدير جاهز!

source: Exporting {0} items...
ar_ly: تصدير {0} عنصر

source: Filter applied successfully
ar_ly: تم تطبيق التصفية بنجاح

source: Filter by Customer
ar_ly: تصفية بحسب الزبون

source: Focused on selected item
ar_ly: التركيز على العنصر المختار

source: from now
ar_ly: منذ الآن

source: Highest Group Count
ar_ly: أعلى مجموعة عدداً

source: Item
ar_ly: العنصر

source: items
ar_ly: من العناصر

source: Items Count
ar_ly: عدد العناصر

source: Items of Selected Impulse: {0}: Count: {1}
ar_ly: عناصر النبضة المختارة: {0} : عددها: {1}

source: Loaded {0} data points
ar_ly: تحميل {0} نقطة بيانات

source: Loading data...
ar_ly: تحميل البيانات...

source: Logarithmic Scale
ar_ly: التدرج اللوغارتمي

source: Lowest Group Count
ar_ly: أقل مجموعة عدداً

source: No data
ar_ly: لا بيانات

source: No Data Available
ar_ly: لا بيانات متاحة

source: No data available for the selected criteria
ar_ly: لا بيانات متاحة للصيغة المختارة

source: No data matches your filter criteria. Try adjusting your filters.
ar_ly: لا بيانات توافق صيغة التصفية. حاول تعديل صيغة فلتر التصفية.

source: Number of Groups
ar_ly: عدد المجموعات

# Point {0} of {1} • {2} • Count: {3} • Items: {4}
source: Point {0} of {1} • {2} • Count: {3} • Objects: {4}
ar_ly: النقطة {0} من {1} • {2} • العدد: {3} • العناصر: {4}

source: Refresh Data
ar_ly: انعاش البيانات

source: Selected Impulse Details:
ar_ly: تفاصيل النبضة المختارة:

source: Selected impulse: {0} with {1} items
ar_ly: النبضة المختارة: {0} مع {1} من العناصر

source: Showing {0} Impulses
ar_ly: عرض {0} من النبضات

source: Start Date
ar_ly: تاريخ البدء

source: Time from Today: {0} days {1}
ar_ly: الوقت من اليوم: {0} يوماً {1}

source: Today
ar_ly: اليوم

source: Total Items
ar_ly: مجموع العناصر

source: Trend Line
ar_ly: الخط المتصل

source: Updated item spacing: {0}px (base: {1}, zoom: {2}x)
ar_ly: تحديث تباعد العناصر: {0} نقطة (التباعد الاساسي: {1}، التكبير: {2} اكس)

source: Zoom level: {0}x
ar_ly: مستوى التكبير: {0} اكس

source: Zoom reset to default
ar_ly: استعادة قيمة التكبير الافتراضية
