Repository: abughuffa/TrdBx
Catalog: src/Server.UI/Resources/Pages/TrdBx/Tickets/Tickets.*.resx
Languages: ar_ly

source: Approve
ar_ly: قبول

source: Assign
ar_ly: تخصيص

source: Assign Date is required!
ar_ly: تاريخ التخصيص مطلوب!

source: Assign Ticket
ar_ly: تخصيص بطاقة

source: Complete
ar_ly: انهاء

source: Created By User
ar_ly: المنشئ

source: Desc
ar_ly: بيـــان

source: Filter By Service
ar_ly: تصفية بحسب الخدمة

source: Filter By Status
ar_ly: تصفية بحسب حالة

source: Modified By User
ar_ly: اخر محدث

source: Note
ar_ly: ملاحظة

source: Note is required!
ar_ly: الملاحظة مطلوبة!

source: Reject
ar_ly: رفض

source: Reject Ticket
ar_ly: رفض بطاقة

source: Release
ar_ly: تخلي

source: Service Task
ar_ly: مهمة الخدمة

source: ServiceTask
ar_ly: مهمة الخدمة

source: Start
ar_ly: بدأ

source: Stop
ar_ly: توقف

source: TaDate
ar_ly: تاريخ التخصيص

source: TcDate
ar_ly: تاريخ الإنشاء

source: TeDate
ar_ly: تاريخ الانهاء

source: Ticket
ar_ly: بطاقة

source: TicketNo
ar_ly: رقم البطاقة

source: Tickets
ar_ly: بطاقات الدعم

source: TicketStatus
ar_ly: الحالة

source: TrackingUnit
ar_ly: وحدة التتبع

source: UnReject
ar_ly: تراجع عن الرفض
