Repository: abughuffa/TrdBx
Catalog: src/Server.UI/Resources/Pages/TrdBx/TrackingUnits/TrackingUnits.*.resx
Languages: ar_ly

source: Activate
ar_ly: تفعيل كامل

source: Activate for Gprs
ar_ly: تفعيل للتمديد

source: Activate for Hosting
ar_ly: تفعيل للاستضافة

source: Activate TrackingUnit {0}
ar_ly: تفعيل الوحدة {0}

source: Activate TrackingUnit {0} for Gprs
ar_ly: تفعيل الوحدة {0} للتمديد

source: Activate TrackingUnit {0} for hosting
ar_ly: تفعيل الوحدة {0} للاستضافة

source: Create Annual Subscription?
ar_ly: انشاء اشتراك سنوي؟

source: Create Deserved Services?
ar_ly: انشاء سجل خدمات مستحقة؟

source: Create Ticket
ar_ly: انشاء بطاقة

source: Create Ticket for {0}
ar_ly: انشاء بطاقة لـ {0}

source: Create Tickets
ar_ly: انشاء بطاقات

source: Create TrackingUnit
ar_ly: انشاء وحدة تتبع

source: Customer
ar_ly: الزبون

source: Customer Is Required!
ar_ly: الزبون مطلوب!

source: Deactivate
ar_ly: إلغاء تفعيل

source: Deactivate TrackingUnit {0}
ar_ly: إلغاء تفعيل الوحدة {0}

source: Filter by Customer
ar_ly: تصفية بحسب الزبون

source: Filter by Status
ar_ly: تصفية بحسب الحالة

source: Id
ar_ly: معرف

source: Imei
ar_ly: ايمي

source: Imei Is Required!
ar_ly: رقم ايمي مطلوب

source: InsMode
ar_ly: نمط التركيب

source: Install
ar_ly: تركيب

source: Install TrackingUnit
ar_ly: تركيب وحدة تتبع

source: Is Tampered?
ar_ly: هل متضرر؟

source: IsOnWialon
ar_ly: على المنصة؟

source: Mark as damaged
ar_ly: تحديد كعاطل

source: Mark as used
ar_ly: تحديد كمستخدم

source: Reassign Owner
ar_ly: إعادة تخصيص المالك

source: Reassign TrackingUnit's Owner
ar_ly: إعادة تخصيص المالك لوحدة التتبع

source: Recover
ar_ly: استرجاع

source: Recover TrackingUnit
ar_ly: استرجاع وحدة تتبع

source: Renew Subscription
ar_ly: تجديد الاشتراك

source: Renew Subscription for {0}
ar_ly: تجديد الاشتراك للوحدة {0}

source: Renew Subscriptions
ar_ly: تجديد الاشتراكات

source: Replace
ar_ly: استبدال

source: Replace TrackingUnit
ar_ly: استبدال وحدة تتبع

source: Replacement Unit
ar_ly: الوحدة البديلة

source: Replacement Unit Is Required!
ar_ly: الوحدة البديلة مطلوبة

source: Reserve
ar_ly: حجز

source: Reserve New TrackingUnit for Customer
ar_ly: حجز وحدة تتبع جديدة لزبون

source: Select Activation date to activate tracking unit's subscription for Gprs.
ar_ly: اختر تاريخ التفعيل لتفعيل اشتراك الوحدة للتمديد.

source: Select Activation date to activate tracking unit's subscription for hosting.
ar_ly: اختر تاريخ التفعيل لتفعيل اشتراك الوحدة للاستضافة.

source: Select Activation date to activate tracking unit's subscription.
ar_ly: اختر تاريخ التفعيل لتفعيل اشتراك الوحدة بشكل كامل.

source: Select Customer
ar_ly: اختر الزبون

source: Select Deactivation date to deactivate tracking unit's subscription.
ar_ly: اختر تاريخ إلغاء تفعيل، لإلغاء تفعيل اشتراك الوحدة.

source: Select Renew date to Renew subscriptions of selected tracking units.
ar_ly: اختر تاريخ التجديد، لتجديد اشتراك الوحدات المختارة.

source: Select Renew date to Renew tracking unit's subscription.
ar_ly: اختر تاريخ التجديد، لتجديد اشتراك الوحدة.

source: Select Replacement Unit
ar_ly: اختر الوحدة البديلة

source: Select Service Task to create technical support ticket for the unit.
ar_ly: اختر مهمة الخدمة لإنشاء بطاقة دعم فني للوحدة.

source: Select Service Task to create technical support ticket for the units.
ar_ly: اختر مهمة الخدمة لإنشاء بطاقة دعم فني للوحدات المختارة.

source: Select SimCard
ar_ly: اختر شريحة الاتصال

source: Select TrackedAsset
ar_ly: اختر الأصل

source: SimCard
ar_ly: الشريحة

source: SimCard Is Required!
ar_ly: شريحة الاتصال مطلوبة!

source: SNo
ar_ly: ر. متسلسل

source: SNo Is Required!
ar_ly: الرقم المتسلسل مطلوب!

source: Subscription
ar_ly: الاشتراك

source: TaskDate
ar_ly: تاريخ المهمة

source: TaskDate Is Required!
ar_ly: تاريخ المهمة مطلوب!

source: TrackedAsset
ar_ly: الأصل

source: TrackedAsset Is Required!
ar_ly: الأصل مطلوب!

source: TrackingUnit
ar_ly: وحدة التتبع

# TrackingUnitModel
source: Model
ar_ly: الطراز

source: TrackingUnits
ar_ly: وحدات التتبع

source: Transfer
ar_ly: نقل

source: Transfer TrackingUnit
ar_ly: نقل وحدة التتبع

source: UnitName
ar_ly: اسم الوحدة

source: Update TrackingUnit
ar_ly: تحديث وحدة التتبع

source: UStatus
ar_ly: الحالة

source: View Services Logs
ar_ly: عرض سجلات الخدمات

source: View subscription periods
ar_ly: عرض دورات الاشتراك

source: View Wialon Tasks
ar_ly: عرض مهام المنصة

source: WryDate
ar_ly: ت. الضمان

source: WStatus
ar_ly: الحالة على المنصة
